app/Filament/Resources/UserResource/Pages/EditUser.php

    protected function mutateFormDataBeforeFill(array $data): array
    {
        $allData = User::with('roles')->find($data['id'])->toArray();
---
select * from `users` where `users`.`id` = 8 limit 1